<!-- dflook/terraform-github-actions {"workspace":"diff-trunc-compare-2","backend_type":"remote","backend":"aed6ef1818520c3fbd0dc89c6a0ef6b8883ae596083f3e4de496c68509abd418","plan_job_ref":"Job Test Terraform cloud #355 at https://github.com/dflook/terraform-github-actions/actions/runs/16695281525","plan_hash":"142011fab54f8cfbb7ba3a8b17344ee96dbcd186c69bd0361b7f02f7950b89d8","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __diff-trunc-compare-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #355](https://github.com/dflook/terraform-github-actions/actions/runs/16695281525)